# GetExtrusionHandle Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCFamilyInstanceExtrusionExportResults..::..GetExtrusionHandle Method
IFCFamilyInstanceExtrusionExportResults Class See Also
---
Gets the extruded solid handle generated for the family instance.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IFCAnyHandle GetExtrusionHandle()
```

Visual Basic
---
```text
Public Function GetExtrusionHandle As IFCAnyHandle
```

Visual C++
---
```text
public:
IFCAnyHandle^ GetExtrusionHandle()
```

# ### Return Value
The handle. If the extrusion analysis failed for the family, this will be a handle with no value assigned.
# See Also
IFCFamilyInstanceExtrusionExportResults Class
Autodesk.Revit.DB.IFC Namespace